GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*
   获取08数据
   约束条件，地址范围  ，起始结束时间，单包数据大小
 */
void vdr_08_fill_data( JT808_TX_NODEDATA *pnodedata )
{
	uint32_t		count = 0;
	uint8_t			* pdata;
	VDR_08_USERDATA * puserdata;
	uint32_t		addr;
	uint8_t			buf[126];
	MYTIME			mytime;

	if( pnodedata == RT_NULL )
	{
		return;
	}

	pdata = pnodedata->tag_data;

	puserdata = (VDR_08_USERDATA* )( pdata[126 * 4 + sizeof( JT808_MSG_HEAD ) + 4] );

/*从当前地址开始倒序读,每次4个record*/
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	addr = puserdata->addr;

	for( count = 0; count < 4; count++ )
	{
		sst25_read( addr, buf + 2, 124 ); /*在存数据时没有存BCD的日期，而是MYTIME的格式*/
		mytime = (uint32_t)( buf[2] << 24 ) | (uint32_t)( buf[3] << 16 ) | (uint32_t)( buf[4] << 8 ) | (uint32_t)( buf[5] );
		//mytime_to_buf(mytime,buf);
		buf[0]	= HEX2BCD( YEAR( mytime ) );
		buf[1]	= HEX2BCD( MONTH( mytime ) );
		buf[2]	= HEX2BCD( DAY( mytime ) );
		buf[3]	= HEX2BCD( HOUR( mytime ) );
		buf[4]	= HEX2BCD( MINUTE( mytime ) );
		buf[5]	= HEX2BCD( SEC( mytime ) );
		if( puserdata->record_total > 4 )                                                       /*多包*/
		{
			memcpy( pdata + sizeof( JT808_MSG_HEAD ) + 4 + count * 126, buf, sizeof( buf ) );   /*拷贝126个到发送区*/
		}
		addr -= 128;                                                                            /*定位到前一个记录*/
		if( addr < VDR_08_START )
		{
			addr = VDR_08_END - 128;
		}
		/*不能拿地址puserdata->addr_to判断是否完成，如果addr_to=VDR_08_START?,用记录数判断*/
		puserdata->record_remain--;
		if( puserdata->record_remain == 0 )
		{
			break;
		}
	}
	rt_sem_release( &sem_dataflash );
#if 1		/*dump 数据*/
	pnodedata->msg_len=count*126+4+sizeof( JT808_MSG_HEAD );
	rt_kprintf("%d>生成 %d bytes\r\n",pnodedata->msg_len);
	rt_kprintf("文件头: ");
	for(count=0;count<14;count++)
	{


	}
#endif	
}

/*收到应答的处理函数*/
static void jt808_tx_response( JT808_TX_NODEDATA * nodedata, uint8_t *pmsg )
{
}

/*超时后的处理函数*/
static void jt808_tx_timeout( JT808_TX_NODEDATA * nodedata )
{
}

/*定位数据的地址?
   从指定的结束时间之前最近的第1分钟的行驶速度记录开始
   要不要传递进nodedata?
   准备要发送的数据，约束条件:开始结束时刻，总的block数

 */
void vdr_08_get_ready( MYTIME start, MYTIME end, uint16_t totalrecord )
{
	uint32_t			addr;
	JT808_TX_NODEDATA	*pnodedata;
	VDR_08_USERDATA		*puserdata;
	uint32_t			i;
	uint16_t			rec_count = 0;              /*找到的记录数*/
	uint8_t				buf[16];

	uint32_t			addr_from	= 0xFFFFFFFF;   /*开始的地址*/
	uint32_t			addr_to		= 0xFFFFFFFF;   /*结束的地址*/

	uint32_t			time_from	= 0xFFFFFFFF;   /*上报记录 开始的时刻，最近的*/
	uint32_t			time_to		= 0xFFFFFFFF;   /*上报记录 结束的时刻，最远的*/

	MYTIME				mytime;

/*从当前位置开始逆序查找*/
	start	&= 0xFFFFFFC0;                          /*忽略秒*/
	end		&= 0xFFFFFFC0;

	rt_kprintf( "%d>开始遍历数据\r\n", rt_tick_get( ) );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	addr = vdr_08_addr + 128;                       /*判断中做了地址递减*/
	for( i = 0; i < VDR_08_SECTORS * 32; i++ )      /*总共找的记录数，完全使用地址判断会不方便*/
	{
		addr -= 128;
		if( addr < VDR_08_START )                   /*环回*/
		{
			addr = VDR_08_END - 128;
		}
		sst25_read( addr, buf, 4 );
		mytime = (uint32_t)( buf[0] << 24 ) | (uint32_t)( buf[1] << 16 ) | (uint32_t)( buf[2] << 8 ) | (uint32_t)( buf[3] );
		if( mytime == 0xFFFFFFFF )
		{
			continue;                                   /*不是有效记录继续查找*/
		}
		mytime &= 0xFFFFFFC0;                           /*忽略秒,对应到分钟*/
		if( ( mytime <= end ) && ( mytime >= start ) )  /*是在时间段内[0..0xffffffff]*/
		{
			rec_count++;                                /*有效记录*/
			if( rec_count >= totalrecord )              /*收到足够的记录数*/
			{
				break;
			}
			if( time_from == 0xFFFFFFFF )               /*记录开始的地址,第一个找到的就是最近的*/
			{
				time_from	= mytime;
				addr_from	= addr;
			}
			if( mytime < time_to )                      /*逆序*/
			{
				time_to = mytime;
				addr_to = addr;
			}
		}
	}

	rt_sem_release( &sem_dataflash );

	rt_kprintf( "%d>遍历结束(%d条) form:%08x to:%08x\r\n", rt_tick_get( ), rec_count, addr_from, addr_to );

/*默认按多包分配*/
	/*126字节一个记录(4个记录),4字节消息封包项,808消息头,行车记录仪的数据头*/

	pnodedata = node_begin( 126 * 4 + 4 + + sizeof( JT808_MSG_HEAD )+sizeof( VDR_08_USERDATA )+7 );
	if( pnodedata == RT_NULL )                                                                                          /*创建失败*/
	{
		rt_kprintf( "\d>vdr生成08数据有误\r\n", rt_tick_get( ) );
		return;
	}
	rt_kprintf( ">生成数据节点\r\n" );

	puserdata					= (VDR_08_USERDATA*)( pnodedata->tag_data[126 * 4 + sizeof( JT808_MSG_HEAD ) + 4] );    /*指向用户数据*/
	puserdata->record_total		= rec_count;
	puserdata->record_remain	= rec_count;
	puserdata->addr_from		= addr_from;
	puserdata->addr_to			= addr_to;
	puserdata->addr				= addr_from;
	puserdata->packet_total		= ( rec_count + 3 ) / 4;                                                                /*每四条记录形成一包*/
	puserdata->packet_curr		= 1;
	vdr_08_fill_data( pnodedata );                                                                                      /*准备数据并发送*/
	rt_kprintf( ">生成数据结束\r\n" );
	node_end( pnodedata, 0xFF00 );
}

FINSH_FUNCTION_EXPORT_ALIAS( vdr_08_get_ready, get_08, get_08_data );


/*
   单位小时内每分钟的位置信息和速度
   最快频率，每分钟一组数据
   360小时=15天
   每天4个sector 每个sector对应6小时，每小时  680字节
 */
void vdr_09_init( void )
{
	uint32_t	addr;
	uint8_t		find = 0;
	uint8_t		buf[32];
	uint32_t	mytime_curr		= 0;
	uint32_t	mytime_vdr_08	= 0;

	uint16_t	sector = 0;
	uint8_t		i;

/*每四个sector代表一天*/
	for( sector = 0; sector < VDR_09_SECTORS; sector++ )
	{
	}

	for( addr = VDR_08_START; addr < VDR_08_END; addr += 4096 )
	{
		sst25_read( addr, buf, 32 );

		mytime_curr = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];   /*前4个字节代表时间*/

		mytime_curr &= 0xFFFFFFC0;                                                      /*频蔽掉sec*/

		if( mytime_curr != 0xFFFFFFFF )                                                 /*是有效记录*/
		{
			if( mytime_curr >= mytime_vdr_08 )
			{
				mytime_vdr_08	= mytime_curr;
				vdr_08_addr		= addr;
				vdr_08_time		= mytime_curr;
				find			= 1;
			}
		}
	}
	if( find == 0 ) /*没有找到有效记录*/
	{
		vdr_08_addr = VDR_08_START + VDR_08_SECTORS * 4096;
	}
	rt_kprintf( "%d>vdr_08 addr=%08x datetime=%08x\r\n", vdr_08_addr, vdr_08_time );
}

